anyway-blows/ti-c2000-motor-control-sdk/c2000ware/device_support/f2806x/MWare/boot_loader/bl_usb.c
        ulTxStatus |= txis;
        ulGenStatus |= usbis;
    }
    while((txis != 0x0000U) || (usbis != 0x0000U));


    //
    // Received a reset from the host.
    //
    if(ulGenStatus & USB_IS_RESET)
    {
        USBDeviceEnumResetHandler();
    }

    //
    // USB device was disconnected.
    //
    if(ulGenStatus & USB_IS_DISCON)
    {
        HandleDisconnect();
    }

    //
    // Handle end point 0 interrupts.
    //
    if(ulTxStatus & USB_TXIE_EP0)
    {
        USBDeviceEnumHandler();
    }
    
    
    PieCtrlRegs.PIEACK.all |= 0x10;
}

//*****************************************************************************
//
//! Send the current state or status structure back to the host.  This function
//! also acknowledges the request which causes us to send back this data.
//
//*****************************************************************************
void
SendDFUStatus(void)
{
    //
    // Acknowledge the original request.
    //
    USBDevEndpoint0DataAck(false);

    //
    // Copy the current state into the status structure we will return.
    //
    g_sDFUStatus.bState = (unsigned char)g_eDFUState;
    g_sDFUStatus.bStatus = (unsigned char)g_eDFUStatus;

    //
    // Send the status structure back to the host.
    //
    USBBLSendDataEP0((unsigned char *)&g_sDFUStatus,
                     sizeof(tDFUGetStatusResponse));
}

//*****************************************************************************
//
//! Send the next block of upload data back to the host assuming data remains
//! to be sent.
//!
//! \param usLength is the requested amount of data.
//! \param bAppendHeader is \b true to append a tDFUDownloadProgHeader at the
//! start of the uploaded data or \b false if no header is required.
//!
//! Returns \b true if a full packet containing DFU_TRANSFER_SIZE bytes
//! was sent and data remains to be sent following this transaction, or \b
//! false if no more data remains to be sent following this transaction.
//
//*****************************************************************************
tBoolean
SendUploadData(unsigned short usLength, tBoolean bAppendHeader)
{
    unsigned short usToSend;
    unsigned long ulAvailable;
    tBoolean bInFlash;

    //
    // Acknowledge the original request.
    //
    USBDevEndpoint0DataAck(false);
   
    //
    // Check to see if we are uploading from flash
    //
    if((unsigned long)g_sNextUpload.pcStart > 0x3D8000 && 
       (unsigned long)g_sNextUpload.pcStart < 0x3F8000)
    {
        bInFlash = true;
    }
    else 
    {
        bInFlash = false;
    }
        
    //
    // How much data is available to be sent?
    //
    if(bInFlash)
    {
#ifdef ENABLE_READ
        if(!g_sDFUDeviceInfo.ucLocked)       
        {
            ulAvailable = 2 * g_sNextUpload.ulLength +
                          (bAppendHeader ? sizeof(tDFUDownloadProgHeader) : 0);
        }
        else
        {
            ulAvailable = (bAppendHeader ? sizeof(tDFUDownloadProgHeader) : 0);
        }
        
#else
        ulAvailable = (bAppendHeader ? sizeof(tDFUDownloadProgHeader) : 0);
#endif
    }
    else
    {
        ulAvailable = g_sNextUpload.ulLength +
                      (bAppendHeader ? sizeof(tDFUDownloadProgHeader) : 0);
    }

    //
    // How much data can we send? This is the smallest of the maximum transfer
    // size, the requested length or the available data.
    //
    usToSend = (usLength > DFU_TRANSFER_SIZE) ? DFU_TRANSFER_SIZE : usLength;
    usToSend = ((unsigned long)usToSend > ulAvailable) ? ulAvailable : usToSend;

    //
    // If we have been asked to send a header, we need to copy some of the
    // data into a buffer and send from there.  If we don't do this, we run the
    // risk of sending a short packet prematurely and ending the upload
    // before it is complete.
    //
    if(bAppendHeader)
    {
        tDFUDownloadProgHeader *psHdr;
        unsigned char *pcFrom;
        unsigned char *pcTo;
        unsigned long ulLoop;

        //
        // We are appending a header so write the header information into a
        // buffer then copy the first chunk of data from its original position
        // into the same buffer.
        //
        psHdr = (tDFUDownloadProgHeader *)g_pcDFUBuffer;

        //
        // Build the header.
        //
        psHdr->ucCommand = DFU_CMD_PROG;
        psHdr->ucReserved = 0;
        writeShort(&(psHdr->usStartAddr), 
                  ((unsigned long)(g_sNextUpload.pcStart) / 1024));
        writeShort(&(psHdr->ulLength), g_sNextUpload.ulLength);

        //
        // Copy the remainder of the first transfer's data from its original
        // position.
        //
        pcFrom = g_sNextUpload.pcStart;
        pcTo = (unsigned char *)(psHdr + 1);

        if(bInFlash)
        {
            for(ulLoop = (usToSend - sizeof(tDFUDownloadProgHeader)) / 2; 
                ulLoop; ulLoop--)
            {
                *pcTo++ = __byte((int*)pcFrom,1);
                *pcTo++ = __byte((int*)pcFrom++,0);
            }
        }
        else
        {    
            for(ulLoop = (usToSend - sizeof(tDFUDownloadProgHeader)); ulLoop;
                ulLoop--)
            {
                *pcTo++ = *pcFrom++;
            }
        }

        //
        // Send the data.
        //
        USBBLSendDataEP0((unsigned char *)psHdr, (unsigned long)usToSend);

        //
        // Update our upload pointer and length.
        //
        if(bInFlash)
        {
            g_sNextUpload.pcStart += (usToSend - 
                                      sizeof(tDFUDownloadProgHeader)) / 2;
            g_sNextUpload.ulLength -= (usToSend - 
                                       sizeof(tDFUDownloadProgHeader)) / 2;
        }
        else
        {
            g_sNextUpload.pcStart += (usToSend - 
                                      sizeof(tDFUDownloadProgHeader));
            g_sNextUpload.ulLength -= (usToSend - 
                                       sizeof(tDFUDownloadProgHeader));
        }
    }
    else
    {
        //
        // We are not sending a header so send the requested upload data back to
        // the host directly from its original position.
        //
        USBBLSendDataEP0((unsigned char *)g_sNextUpload.pcStart,
                         (unsigned long)usToSend);

        //
        // Update our upload pointer and length.
        //
        if(bInFlash)
        {
            g_sNextUpload.pcStart += usToSend / 2;
            g_sNextUpload.ulLength -= usToSend / 2;
        }
        else
        {
            g_sNextUpload.pcStart += usToSend;
            g_sNextUpload.ulLength -= usToSend;
        }    

