anyway-blows/ti-c2000-motor-control-sdk/c2000ware/device_support/f2806x/MWare/boot_loader/bl_usb.c
}
//*****************************************************************************
//
//! Manifest Sync request handler
//!
//! \param pUSBRequest USB request to handle.
//!
//! Handle all incoming DFU requests while in state STATE_MANIFEST_SYNC.
//
//*****************************************************************************
void
HandleRequestManifestSync(tUSBRequest *pUSBRequest)
{
    //
    // In this state, we have received the last block of a download and are
    // waiting for a USBD_DFU_REQUEST_GETSTATUS which will trigger a return
    // to STATE_IDLE.
    //
    switch(pUSBRequest->bRequest)
    {
        //
        // The host is requesting the current device status.  Return this and
        // revert to STATE_IDLE.
        //
        case USBD_DFU_REQUEST_GETSTATUS:
        {
            g_eDFUState = STATE_IDLE;
            SendDFUStatus();
            break;
        }

        //
        // The host is requesting the current device state.
        //
        case USBD_DFU_REQUEST_GETSTATE:
        {
            SendDFUState();
            break;
        }

        //
        // Any other request is ignored and causes us to stall the control
        // endpoint and remain in STATE_MANIFEST_SYNC.
        //
        default:
        {
            USBBLStallEP0();
            break;
        }
    }
}

//*****************************************************************************
//
//! Upload Idle request handler
//!
//! \param pUSBRequest USB request to handle.
//!
//! Handle all incoming DFU requests while in state STATE_UPLOAD_IDLE.
//
//*****************************************************************************
void
HandleRequestUploadIdle(tUSBRequest *pUSBRequest)
{
    //
    // In this state, we have already received the first upload request. 
    // What are we being asked to do now?
    //
    switch(pUSBRequest->bRequest)
    {
        //
        // The host is requesting more upload data.
        //
        case USBD_DFU_REQUEST_UPLOAD:
        {
            //
            // See if there is any more data to transfer and, if there is,
            // send it back to the host.
            //
            if(!SendUploadData(readShort(&(pUSBRequest->wLength)), false))
            {
                //
                // We sent less than a full packet of data so the transfer is
                // complete.  Revert to idle state and ensure that we reset
                // our upload pointer and size to the default flash region.
                //
                g_eDFUState = STATE_IDLE;
                g_sNextUpload.pcStart =
                    (unsigned char *)readLong(&(g_sDFUDeviceInfo.ulAppStartAddr));
                g_sNextUpload.ulLength =
                    (readLong(&(g_sDFUDeviceInfo.ulFlashTop)) -
                     readLong(&(g_sDFUDeviceInfo.ulAppStartAddr)));
            }
            break;
        }

        //
        // The host is requesting the current device status.
        //
        case USBD_DFU_REQUEST_GETSTATUS:
        {
            SendDFUStatus();
            break;
        }

        //
        // The host is requesting the current device state.
        //
        case USBD_DFU_REQUEST_GETSTATE:
        {
            SendDFUState();
            break;
        }

        //
        // The host is requesting that we abort the current upload.
        //
        case USBD_DFU_REQUEST_ABORT:
        {
            //
            // Default to sending the main application image for the next
            // upload.
            //
            g_sNextUpload.pcStart =
                (unsigned char *)readLong(&(g_sDFUDeviceInfo.ulAppStartAddr));
            g_sNextUpload.ulLength = 
                (readLong(&(g_sDFUDeviceInfo.ulFlashTop)) -
                 readLong(&(g_sDFUDeviceInfo.ulAppStartAddr)));
            g_eDFUState = STATE_IDLE;
            break;
        }

        //
        // Any other request is ignored and causes us to stall the control
        // endpoint and remain in STATE_ERROR.
        //
        default:
        {
            USBBLStallEP0();
            break;
        }
    }

}

//*****************************************************************************
//
//! Error request handler
//!
//! \param pUSBRequest USB request to handle.
//!
//! Handle all incoming DFU requests while in state STATE_ERROR.
//
//*****************************************************************************
void
HandleRequestError(tUSBRequest *pUSBRequest)
{
    //
    // In this state, we respond to state and status requests and also to
    // USBD_DFU_REQUEST_CLRSTATUS which clears the previous error condition.
    //
    switch(pUSBRequest->bRequest)
    {
        //
        // The host is requesting the current device status.
        //
        case USBD_DFU_REQUEST_GETSTATUS:
        {
            SendDFUStatus();
            break;
        }

        //
        // The host is requesting the current device state.
        //
        case USBD_DFU_REQUEST_GETSTATE:
        {
            SendDFUState();
            break;
        }

        //
        // The host is asking us to clear our previous error condition and
        // revert to idle state in preparation to receive new commands.
        //
        case USBD_DFU_REQUEST_CLRSTATUS:
        {
            g_eDFUState = STATE_IDLE;
            g_eDFUStatus = STATUS_OK;
            g_ulCommandFlags = 0;
            USBDevEndpoint0DataAck(false);
            break;
        }

        //
        // Any other request is ignored and causes us to stall the control
        // endpoint and remain in STATE_ERROR.
        //
        default:
        {
            USBBLStallEP0();
            break;
        }
    }
}

//*****************************************************************************
//
//! Handle cases where the host sets a new USB configuration.
//!
//! \param ulInfo Is not used in this implementation.
//
//*****************************************************************************
void
HandleConfigChange(unsigned long ulInfo)
{
    //
    // Revert to idle state.
    //
    g_eDFUState = STATE_IDLE;
    g_eDFUStatus = STATUS_OK;
}

//*****************************************************************************
//
//! Setting the device address indicates that we are now connected to the host
//! and can expect some DFU communication so we use this opportunity to clean
//! out our state just in case we were not idle last time the host disconnected.
//
//*****************************************************************************
void
HandleSetAddress(void)
{
    g_eDFUState = STATE_IDLE;
    g_eDFUStatus = STATUS_OK;
    g_bAddressSet = true;

    //
    // Default the download address to the app start address and valid length
    // to the whole of the programmable flash area.
    //
    g_sNextDownload.pcStart =
                (unsigned char *)readLong(&(g_sDFUDeviceInfo.ulAppStartAddr));
    g_sNextDownload.ulLength = (readLong(&(g_sDFUDeviceInfo.ulFlashTop)) -
                                readLong(&(g_sDFUDeviceInfo.ulAppStartAddr)));

    //
    // Default the upload address to the app start address and valid length
    // to the whole of the programmable flash area.
    //
    g_sNextUpload.pcStart =
                (unsigned char *)readLong(&(g_sDFUDeviceInfo.ulAppStartAddr));
    g_sNextUpload.ulLength = (readLong(&(g_sDFUDeviceInfo.ulFlashTop)) -
                              readLong(&(g_sDFUDeviceInfo.ulAppStartAddr)));
}

//*****************************************************************************
//
//! Check that a range of addresses passed is within the region of flash that
//! the boot loader is allowed to access.
//!
//! \param ulStart Starting address of flash range to be checked
//! \param ulLength Length of flash range to be checked
//!
//! \return True if the address range is accessible or false otherwise.
//
//*****************************************************************************
tBoolean
FlashRangeCheck(unsigned long ulStart, unsigned long ulLength)
{        


    if((ulStart >= readLong(&(g_sDFUDeviceInfo.ulAppStartAddr))) && 
       (ulLength <= (readLong(&(g_sDFUDeviceInfo.ulFlashTop)) - 
       readLong(&(g_sDFUDeviceInfo.ulAppStartAddr)))) &&
       ((ulStart + ulLength) <= readLong(&(g_sDFUDeviceInfo.ulFlashTop))))   
    {
        //
        // The block passed lies wholly within the flash address range of
        // this device.
        //
        return(true);
    }
    else
    {
        //
        // We were passed an address that is out of range so set the
        // appropriate status code.
        //
        g_eDFUStatus = STATUS_ERR_ADDRESS;
        return(false);
    }
}

//*****************************************************************************
//
//! Flash API callback (used to kick the watchdog)
//
//*****************************************************************************
#ifdef ENABLE_WATCHDOG
void 
FlashAPICallback(void)
{
    //
    // Kick the watchdog
    //
    EALLOW;
    SysCtrlRegs.WDKEY = 0x0055;
    SysCtrlRegs.WDKEY = 0x00AA;
    EDIS;        
}
#endif

//*****************************************************************************
//
//! Initialize variables needed by the flash api
//
//*****************************************************************************
void 
FlashAPIInit(void)
{
    EALLOW;
    Flash_CPUScaleFactor = SCALE_FACTOR;
#ifdef ENABLE_WATCHDOG    
    Flash_CallbackPtr = FlashAPICallback;
#else
    Flash_CallbackPtr = 0;
#endif    
    EDIS;    
    
