anyway-blows/ti-c2000-motor-control-sdk/c2000ware/device_support/f2806x/MWare/boot_loader/bl_usb.c
}

//*****************************************************************************
//
//! Get the sector index given a start address and size
//!
//! \param ulAddress is the address of the block of flash to erase.
//! \param ulSize is the size of the block of memory to return the index for
//!
//! This function converts and address and size into the index format used
//! by the flash erase function.
//!
//! \return Index for use with flash erase function
//
//*****************************************************************************
unsigned long
FlashAPIIndex(unsigned long ulAddress, unsigned long ulSize)
{
    volatile unsigned long ulIdx;
    volatile unsigned long ulTemp;
    
    //
    // Runtime check
    //
    if((ulAddress < FLASH_START_ADDR) || 
       ((ulAddress + ulSize) > FLASH_END_ADDR))
        return 0;
        
    ulTemp = 0;

    for(ulIdx = FLASH_START_ADDR ; ulIdx <= FLASH_END_ADDR ; 
        ulIdx += FLASH_PAGE_SIZE)
    {
        if((ulIdx >= (unsigned long)ulAddress) && 
           (ulIdx <= ((unsigned long)ulAddress + ulSize)))
        {
            ulTemp = (ulTemp << 1) | 1;
        }        
    }
    return ulTemp;
}

#ifdef ENABLE_WATCHDOG
//*****************************************************************************
//
//! Enable the watchdog timer
//
//*****************************************************************************
void
WatchdogEnable(void)
{
    EALLOW;
    
    //
    // Enable the watchdog
    //
    SysCtrlRegs.WDCR = 0x4E;
    EDIS;
}
#endif

//*****************************************************************************
//
//! Process TI-specific commands passed via DFU download requests.
//!
//! \param pcCmd is a pointer to the first byte of the \b DFU_DNLOAD payload
//! that is expected to hold a command.
//! \param ulSize is the number of bytes of data pointed to by \e pcCmd.
//! This function is called when a DFU download command is received while in
//! \b STATE_IDLE.  New downloads are assumed to contain a prefix structure
//! containing one of several TI-specific commands and this function
//! is responsible for parsing the download data and processing whichever
//! command is contained within it.
//!
//! \return Returns \b true on success or \b false on failure.
//
//*****************************************************************************
tBoolean
ProcessDFUDnloadCommand(tDFUDownloadHeader *pcCmd, unsigned long ulSize)
{
    //
    // Make sure we got enough data to contain a valid command header.
    //
    if(ulSize < sizeof(tDFUDownloadHeader))
    {
        return(false);
    }

    //
    // Remember the command that we have been passed since we will need thi
    // to determine which state to transition to on exit from STATE_DNLOAD_SYNC.
    //
    g_ucLastCommand = pcCmd->ucCommand;

    //
    // Which command have we been passed?
    //
    switch(pcCmd->ucCommand)
    {
        //
        // We are being asked to start a programming operation.
        //
        case DFU_CMD_PROG:
        {
            tDFUDownloadProgHeader *psHdr;

            //
            // Extract the address and size from the command header.
            //
            psHdr = (tDFUDownloadProgHeader *)pcCmd;

            //
            // Is the passed address range valid?
            //
            if(FlashRangeCheck((unsigned long)readShort(&(psHdr->usStartAddr)) * 1024,
                                readLong(&(psHdr->ulLength))))
            {
                //
                // Yes - remember the range passed so that we will write the
                // passed data to the correct place.
                //
                g_sNextDownload.pcStart =
                    (unsigned char *)((unsigned long)readShort(&(psHdr->usStartAddr)) * 1024);
                g_sNextDownload.ulLength = readLong(&(psHdr->ulLength));

                //
                // If we have been provided with a progress reporting hook
                // function, remember the total length of the image so that
                // we can report this later.
                //
#ifdef BL_PROGRESS_FN_HOOK
                g_ulImageSize = psHdr->ulLength;
#endif

                //
                // Also set the upload address and size to match this download
                // so that, by default, the host will get back what it just
                // wrote if it performs an upload without an intermediate
                // DFU_CMD_READ to set the address and size.
                //
                g_sNextUpload.pcStart =
                    (unsigned char *)((unsigned long)readShort(&(psHdr->usStartAddr)) * 1024);
                g_sNextUpload.ulLength = readLong(&(psHdr->ulLength));

                //
                // Also remember that we have data in this packet to write.
                //
                g_pcDFUWrite = (unsigned char *)(psHdr + 1);
                g_usDFUBufferUsed = ulSize - sizeof(tDFUDownloadHeader);

                //
                // If a start signal hook function has been provided, call it
                // here since we are about to start a new download.
                //
#ifdef BL_START_FN_HOOK
                BL_START_FN_HOOK();
#endif

                //
                // Tell the main thread to write the data we just received it.
                //
                HWREGBITW(&g_ulCommandFlags, CMD_FLAG_WRITE, 1);
            }
            else
            {
                //
                // The flash range was invalid so switch to error state.
                //
                return(false);
            }
            break;
        }
        
#ifdef ENABLE_READ
        //
        // We are being passed the position and size of a block of flash to
        // return in a following upload operation.
        //
        case DFU_CMD_READ:
        {
            tDFUDownloadReadCheckHeader *psHdr;

            //
            // Extract the address and size from the command header.
            //
            psHdr = (tDFUDownloadReadCheckHeader *)pcCmd;

            //
            // Is the passed address range valid and the flash unlocked
            //
            if(FlashRangeCheck((unsigned long)readShort(&(psHdr->usStartAddr)) * 1024,
               readLong(&(psHdr->ulLength))))
            {
                //
                // Yes - remember the range passed so that we will return
                // this block of flash on the next upload request.
                //
                g_sNextUpload.pcStart =
                    (unsigned char *)((unsigned long)readShort(&(psHdr->usStartAddr)) * 1024);
                g_sNextUpload.ulLength = readLong(&(psHdr->ulLength));
            }
            else
            {
                //
                // The flash range was invalid so switch to error state.
                //
                return(false);
            }
            break;
        }
#endif

        //
        // We are being passed the position and size of a block of flash which
        // we will check to ensure that it is erased.
        //
        case DFU_CMD_CHECK:
        {
            tDFUDownloadReadCheckHeader *psHdr;
            unsigned short *pusCheck;
            unsigned long ulLoop;

            //
            // Extract the address and size from the command header.
            //
            psHdr = (tDFUDownloadReadCheckHeader *)pcCmd;

            //
            // Make sure the range we have been passed is within the area of
            // flash that we are allowed to look at.
            //
            if(FlashRangeCheck((unsigned long)readShort(&(psHdr->usStartAddr)) * 1024,
               readLong(&(psHdr->ulLength))))
            {
                //
                // The range is valid so perform the check here.
                //
                pusCheck = (unsigned short *)((unsigned long)readShort(&(psHdr->usStartAddr)) * 1024);

                //
                // Check each word in the range to ensure that it is erased.  
                // If not, set the error status and return.
                //
                for(ulLoop = 0; (ulLoop < readLong(&(psHdr->ulLength))) && 
                    ((unsigned long) pusCheck < 0x3F7F80); ulLoop++)
                {
                    if(*pusCheck != 0xFFFF)
                    {
                        g_eDFUStatus = STATUS_ERR_CHECK_ERASED;
                        return(false);
                    }
                    pusCheck++;
                }

                //
                // If we get here, the check passed so set the status to
                // indicate this.
                //
                g_eDFUStatus = STATUS_OK;
            }
            else
            {
                //
                // The flash range was invalid so switch to error state.
                //
                return(false);
            }
            break;
        }

        //
        // We are being asked to erase a block of flash.
        //
        case DFU_CMD_ERASE:
        {
            tDFUDownloadEraseHeader *psHdr;
            volatile unsigned short usTemp;
            //
            // Extract the address and size from the command header.
            //
            psHdr = (tDFUDownloadEraseHeader *)pcCmd;

            usTemp = readShort(&(psHdr->usNumBlocks));
            //
            // Make sure the range we have been passed is within the area of
            // flash that we are allowed to look at.
            //
            if(FlashRangeCheck((unsigned long)readShort(&(psHdr->usStartAddr)) * 1024,
                               ((unsigned long)readShort(&(psHdr->usNumBlocks)) *
                                1024 )))
            {
                //
                // The range is valid so tell the main loop to erase the
                // block.
                //
                g_sErase.pcStart =(unsigned char *)
                                   ((unsigned long)readShort(&(psHdr->usStartAddr)) * 1024);
                g_sErase.ulLength = ((unsigned long)readShort(&(psHdr->usNumBlocks)) *
                                     1024);
                HWREGBITW(&g_ulCommandFlags, CMD_FLAG_ERASE, 1);
            }
            else
            {
                //
                // The flash range was invalid so switch to error state.
                //
                return(false);
            }
            break;
        }

        //
        // We are being asked to send back device information on the next
        // upload request.
        //
        case DFU_CMD_INFO:
        {
            //
            // Update lock status
            //
            g_sDFUDeviceInfo.ucLocked = CsmRegs.CSMSCR.bit.SECURE;
    
            //
            // Register that we need to send the device info structure on the
            // next upload request.
            //
            g_sNextUpload.pcStart = (unsigned char *)&g_sDFUDeviceInfo;
            g_sNextUpload.ulLength = sizeof(tDFUDeviceInfo);

            //
            // Make sure we don't append the DFU_CMD_PROG header when we send
            // back the data.
            //
            g_bSuppressUploadHeader = true;
            break;
        }

        //
        // We are being asked to set the format of uploaded images.
        //
        case DFU_CMD_BIN:
        {
            tDFUDownloadBinHeader *psHdr;

            //
            // Extract the requried format the command header.
            //
            psHdr = (tDFUDownloadBinHeader *)pcCmd;

            //
            // Set the global format appropriately.
            //
            g_bUploadBinary = psHdr->bBinary ? true : false;
            break;
        }

        //
        // We are being asked to prepare to reset the board and, as a result,
        // run the main application image.
        //
        case DFU_CMD_RESET:
        {
            //
            // Tell the main thread that it's time to go bye-bye...
            //
            HWREGBITW(&g_ulCommandFlags, CMD_FLAG_RESET, 1);

            break;
        }

        //
        // We have been passed an unrecognized command identifier so report an
        // error.
        //
        default:
        {
            g_eDFUStatus = STATUS_ERR_VENDOR;
            return(false);
        }
    }

    return(true);
}

//*****************************************************************************
//
//! EP0 Data callback
//!
//! \param ulSize The size of data available in EP0.
//! 
//! This callback function is called when data is received for the DATA phase
//! of an EP0 OUT transaction.  This data will either be a block of download
//! data (if we are in STATE_DNLOAD_IDLE) or a new command (if we are in
//! STATE_IDLE).
//
//*****************************************************************************
void
HandleEP0Data(unsigned long ulSize)
{
    tBoolean bRetcode;

    if(g_eDFUState == STATE_IDLE)
    {
        //
        // This must be a new DFU download command header so parse it and
        // determine what to do next.
        //
        bRetcode = ProcessDFUDnloadCommand((tDFUDownloadHeader *)g_pcDFUBuffer,
                                           ulSize);

        //
        // Did we receive a recognized and valid command?
        //
        if(!bRetcode)
        {
            //
            // No - set the error state.  The status is set within the
            // ProcessDFUDnloadCommand() function.
            //
            g_eDFUState = STATE_ERROR;
            return;
        }
    }
    else
    {
        //
        // If we are not in STATE_IDLE, this must be a block of data for an
        // ongoing download so signal the main thread to write it to flash.
        //
        g_usDFUBufferUsed = (unsigned short)ulSize;
        g_pcDFUWrite = g_pcDFUBuffer;

        //
        // Tell the main thread to write the new data.
        //
        HWREGBITW(&g_ulCommandFlags, CMD_FLAG_WRITE, 1);
    }

    //
    // Move to STATE_DNLOAD_SYNC since we now expect USBD_DFU_REQUEST_GETSTATUS
    // before the next USBD_DFU_REQUEST_DNLOAD.
    //
    g_eDFUState = STATE_DNLOAD_SYNC;
}

//*****************************************************************************
//
//! Handle bus resets
//!
//! This function is called if the USB controller detects a reset condition on
//! the bus.  If we are not in the process of downloading a new image, we use
//! this as a signal to reboot and run the main application image.
//
//*****************************************************************************
void
HandleReset(void)
{
    //
    // Are we currently in the middle of a download operation?
    //
    if((g_eDFUState != STATE_DNLOAD_IDLE) && (g_eDFUState != STATE_DNLOAD_SYNC) &&
       (g_eDFUState != STATE_IDLE))
    {
        //
        // No - tell the main thread that it should reboot the system assuming
        // that we are already configured.  If we don't check that we are
        // already configured, this will cause a reset during initial
        // enumeration and that wouldn't be very helpful.
        //
        if(g_bAddressSet)
        {
            HWREGBITW(&g_ulCommandFlags, CMD_FLAG_RESET, 1);
        }
    }
    else
    {
        g_eDFUState = STATE_IDLE;
    }
}

//*****************************************************************************
//
//! Handle cases where the USB host disconnects.
//
//*****************************************************************************
void
HandleDisconnect(void)
{
    //
    // For error resilience, it may be desireable to note if the host
    // disconnects and, if partway through a main image download, clear the
    // first block of the flash to ensure that the image is not considered
    // valid on the next boot.  For now, however, we merely wait for the host
    // to connect again, remaining in DFU mode.
    //

    //
    // Remember that we are waiting for enumeration.
    //
    g_bAddressSet = false;
}

//*****************************************************************************
//
//! Compact a byte array (0x00XX, 0x00YY) into a word array (0xXXYY)
//! 
//! \param pucBuffer Buffer to compact
//! \param ulBufferSize Buffer size before compaction
//
//*****************************************************************************
void
CompactBuffer(unsigned char *pucBuffer, unsigned long ulBufferSize)
{
    unsigned char *pucCurrentByte, *pucDestWord;
    
    pucDestWord = pucBuffer;
    pucCurrentByte = pucBuffer;
    
