anyway-blows/ti-c2000-motor-control-sdk/c2000ware/device_support/f2806x/MWare/boot_loader/bl_usb.c
    for(;pucDestWord < pucBuffer + (ulBufferSize/2);)
    {
        *pucDestWord++ = ((*pucCurrentByte & 0xFF) << 8) | 
                         (*(pucCurrentByte + 1) & 0xFF);
        pucCurrentByte += 2;
    }
}

#ifdef ENABLE_FAILSAFE
//*****************************************************************************
//
//! Copy the bootloader from flash sector H to flash sector G
//
//*****************************************************************************
void
CopyBLHtoG(void)
{
    //
    // Copy Bootloader entry table
    //
    MemCopy((Uint16 *)&BLTableStart, (Uint16 *)&BLTableEnd,
            (Uint16 *)g_pcCopyBuffer);
    Flash2806x_Program((Uint16 *)&BLTableStart+0x4000, 
                       (Uint16 *) g_pcCopyBuffer, 
                       (unsigned long)&BLTableEnd - 
                       (unsigned long)&BLTableStart, 
                       &g_FlashStatus);
    
    //
    // Copy Init Section
    //
    MemCopy((Uint16 *)&InitLoadStart, (Uint16 *)&InitLoadEnd, 
            (Uint16 *)g_pcCopyBuffer);
    Flash2806x_Program((Uint16 *)&InitLoadStart+0x4000, 
                       (Uint16 *) g_pcCopyBuffer, 
                       (unsigned long)&InitLoadEnd - 
                       (unsigned long)&InitLoadStart, 
                       &g_FlashStatus);
    //
    // Copy BL Kernel
    //
    MemCopy((Uint16 *)&RamfuncsLoadStart, (Uint16 *)&RamfuncsLoadEnd, 
            (Uint16 *)g_pcCopyBuffer);
    Flash2806x_Program((Uint16 *)&RamfuncsLoadStart+0x4000, 
                       (Uint16 *) g_pcCopyBuffer, 
                       (unsigned long)&RamfuncsLoadEnd - 
                       (unsigned long)&RamfuncsLoadStart, 
                       &g_FlashStatus);
    //                        
    // Copy Failsafe Entry
    //
    MemCopy((Uint16 *)&FailsafeLoadStart, (Uint16 *)&FailsafeLoadEnd,
            (Uint16 *)g_pcCopyBuffer);
    Flash2806x_Program((Uint16 *)&FailsafeRunStart, 
                       (Uint16 *) g_pcCopyBuffer, 
                       (unsigned long)&FailsafeLoadEnd - 
                       (unsigned long)&FailsafeLoadStart, 
                       &g_FlashStatus);                             
}

//*****************************************************************************
//
//! Copy the bootloader from flash sector G to flash sector H
//
//*****************************************************************************
void CopyBLGtoH(void)
{
    //
    // Copy Bootloader entry table
    //
    FailSafeMemCopy((Uint16 *)&BLTableStart+0x4000, (Uint16 *)&BLTableEnd+0x4000, 
                    (Uint16 *)g_pcCopyBuffer);
    Flash2806x_Program((Uint16 *)&BLTableStart, 
                       (Uint16 *) g_pcCopyBuffer, 
                       (unsigned long)&BLTableEnd - (unsigned long)&BLTableStart, 
                       &g_FlashStatus);
    
    //
    // Copy Init Section
    //
    FailSafeMemCopy((Uint16 *)&InitLoadStart+0x4000, (Uint16 *)&InitLoadEnd+0x4000, 
                    (Uint16 *)g_pcCopyBuffer);
    Flash2806x_Program((Uint16 *)&InitLoadStart, 
                       (Uint16 *) g_pcCopyBuffer, 
                       (unsigned long)&InitLoadEnd - (unsigned long)&InitLoadStart, 
                       &g_FlashStatus);

    // Copy BL Kernel
    FailSafeMemCopy((Uint16 *)&RamfuncsLoadStart+0x4000, (Uint16 *)&RamfuncsLoadEnd+0x4000, 
                    (Uint16 *)g_pcCopyBuffer);
    Flash2806x_Program((Uint16 *)&RamfuncsLoadStart, 
                       (Uint16 *) g_pcCopyBuffer, 
                       (unsigned long)&RamfuncsLoadEnd - (unsigned long)&RamfuncsLoadStart, 
                       &g_FlashStatus);

    // Copy Failsafe Entry
    FailSafeMemCopy((Uint16 *)&FailsafeRunStart, (Uint16 *)&FailsafeRunStart+
                    (unsigned long)&FailsafeLoadEnd - (unsigned long)&FailsafeLoadStart, 
                    (Uint16 *)g_pcCopyBuffer);
    Flash2806x_Program((Uint16 *)&FailsafeLoadStart, 
                       (Uint16 *) g_pcCopyBuffer, 
                       (unsigned long)&FailsafeLoadEnd - (unsigned long)&FailsafeLoadStart, 
                       &g_FlashStatus);                   
}

//*****************************************************************************
//
//! Erase and program sector A of flash with the entry point for the failsafe
//! bootloader.
//
//*****************************************************************************
void
ProgramBLFailsafeVector(void)
{                                              
    //
    // Copy Failsafe Codestart
    //
    MemCopy((Uint16 *)&code_start_f, (Uint16 *)(&code_start_f + 1), 
            (Uint16 *)g_pcCopyBuffer); 
    
    //
    // Erase Sector A
    //
    Flash2806x_Erase(0x01, &g_FlashStatus);
    
    //
    // Program Boot to Flash Vector with Failsafe codestart
    //
    Flash2806x_Program((Uint16 *)0x3F7FF6, 
                       (Uint16 *) g_pcCopyBuffer, 
                        2, 
                       &g_FlashStatus);
}
#endif

//*****************************************************************************
//
//! Erase and program sector A of flash with the entry point for the normal
//! bootloader.
//
//*****************************************************************************
void
ProgramBLNormalVector(void)
{
    //
    // Copy Failsafe Codestart                                             
    //
    MemCopy((Uint16 *)&code_start_n, (Uint16 *)(&code_start_n + 1), 
            (Uint16 *)g_pcCopyBuffer); 
    
    //
    // Erase Sector A
    //
    Flash2806x_Erase(0x01, &g_FlashStatus);
    
    //
    // Program Boot to Flash Vector with Normal codestart
    //
    Flash2806x_Program((Uint16 *)0x3F7FF6, 
                       (Uint16 *) g_pcCopyBuffer, 
                        2, 
                       &g_FlashStatus);
}

//*****************************************************************************
//
//! This is the main routine for handling updating over USB.
//!
//! This function forms the main loop of the USB DFU updater.  It polls for
//! commands sent from the USB request handlers and is responsible for
//! erasing flash blocks, programming data into erased blocks and resetting
//! the device.
//!
//! \return None.
//
//*****************************************************************************
void
UpdaterUSB(void)
{
    unsigned long  ulStart, ulTemp;
    unsigned short usUsed;

    usUsed = 0;

    //
    // Initialize Flash functions
    //
    FlashAPIInit();

    //
    // Loop forever waiting for the USB interrupt handlers to tell us to do
    // something.
    //
    while(1)
    {
        while((g_ulCommandFlags & 0xFFFF) == 0)
        {
            //
            // Wait for something to do.
            //
#ifdef ENABLE_WATCHDOG
            EALLOW;
            SysCtrlRegs.WDKEY = 0x0055;
            SysCtrlRegs.WDKEY = 0x00AA;
            EDIS;        
#endif                        
        }

        //
        // Are we being asked to perform a system reset?
        //
        if(HWREGBITR(&g_ulCommandFlags, CMD_FLAG_RESET))
        {
            //
            // Time to go bye-bye...  This will cause the microcontroller
            // to reset; no further code will be executed.
            //
            
            //
            // Enable watchdog reset
            //
            SysCtrlRegs.SCSR &= ~0x02;
            
            //
            // Enable the Watchdog
            //
            SysCtrlRegs.WDCR = 0x28;
            
            //
            // Force a reset
            //
            SysCtrlRegs.WDCR = 0x00;

            //
            // The microcontroller should have reset, so this should never be
            // reached.  Just in case, loop forever.
            //
            while(1)
            {
                
