anyway-blows/ti-c2000-motor-control-sdk/c2000ware/device_support/f2806x/MWare/boot_loader/bl_usb.c
}
#endif

//*****************************************************************************
//
//! Generic configuration is handled in this function.
//!
//! This function is called by the start up code to perform any configuration
//! necessary before calling the update routine.  It is responsible for setting
//! the system clock to the expected rate and setting flash programming
//! parameters prior to calling ConfigureUSBInterface() to set up the USB
//! hardware and place the DFU device on the bus.
//!
//! \b IMPORTANT: If using a F28069M Launchpad, the Launchpad doesn't have an
//! external oscillator populated. Running this will result in a missing clock
//! NMI. Although for USB an external oscillator is recommended, for Launchpad
//! use, switch the following code to use the internal oscillator or XCLKINs.
//!
//! \return None.
//
//*****************************************************************************
void
ConfigureUSB(void)
{
    //
    // Enable the main oscillator.
    //
    EALLOW;
    SysCtrlRegs.CLKCTL.bit.XCLKINOFF = 1;
    SysCtrlRegs.CLKCTL.bit.XTALOSCOFF = 0;
    SysCtrlRegs.CLKCTL.bit.OSCCLKSRC2SEL = 0;
    SysCtrlRegs.CLKCTL.bit.OSCCLKSRCSEL = 1;
    
    //
    // DELAY_US while the main oscillator starts up.
    //
    DELAY_US(10);

    //
    // Set the crystal frequency, switch to the main oscillator, and enable the
    // PLL.
    //
    // Setup PLL for 80Mhz
    // Calculate the appropriate multiplier with the given crystal frequency
    //
    while(SysCtrlRegs.PLLSTS.bit.MCLKSTS);
    SysCtrlRegs.PLLSTS.bit.DIVSEL = 0;
    SysCtrlRegs.PLLSTS.bit.MCLKOFF = 1;
    SysCtrlRegs.PLLCR.bit.DIV = 80000000UL/CRYSTAL_FREQ;
    while(!SysCtrlRegs.PLLSTS.bit.PLLLOCKS);
    SysCtrlRegs.PLLSTS.bit.MCLKOFF = 1;
    SysCtrlRegs.PLLSTS.bit.DIVSEL = 3;

    //
    // DELAY_US while the PLL locks.
    //
    DELAY_US(10);

    //
    // Setup PLL2 for 60Mhz operation
    // Calculate the appropriate multiplier with the given crystal frequency
    //
    SysCtrlRegs.PLL2CTL.bit.PLL2CLKSRCSEL = 2;
    SysCtrlRegs.PLL2CTL.bit.PLL2EN = 1;
    SysCtrlRegs.PLL2MULT.bit.PLL2MULT = 120000000/CRYSTAL_FREQ;
    while(!SysCtrlRegs.PLL2STS.bit.PLL2LOCKS);

    InitPieCtrl();
    InitPieVectTable();
    EDIS;
    //
    // If the target device has a mux to allow selection of USB host or
    // device mode, make sure this is set to device mode.
    //
#ifdef USB_HAS_MUX
    SetUSBMux();
#endif

    //
    // Configure the USB interface and put the device on the bus.
    //
    ConfigureUSBInterface();
}

//*****************************************************************************
//
//! Application Check function
//!
//! This funciton checks the application entry table and if requested the 
//! associated CRC table to ensure that a valid application is programmed 
//! before jumping to it.  If any of the checks fail, the bootloader is entered
//! so that an application image may be programmed.
//
//*****************************************************************************
#pragma CODE_SECTION(AppCheck, "normal")
void AppCheck(void)
{
    if(CheckForceUpdate())
    {
        return;
    }

#ifdef CHECK_CRC    
    if(CheckCRCTable((CRC_TABLE *) pAppSig))
    {
        return;    
    }
#endif
    if(((unsigned long)pAppEntry != 0xFFFFFFFF) && 
       ((unsigned long)pAppEntry    != 0x00000000))
    {
        ((void (*)(void))pAppEntry)();
    }
}

//*****************************************************************************
//
//! This is the application entry point to the USB updater.
//!
//! This function should only be entered from a running application and not
//! when running the boot loader with no application present.  If the
//! calling application supports any USB device function, it must remove
//! itself from the USB bus prior to calling this function.  This function
//! assumes that the calling application has already configured the system
//! clock to run from the PLL.
//!
//! \return None.
//
//*****************************************************************************
#pragma CODE_SECTION(AppUpdaterUSB, "normal")
void
AppUpdaterUSB(void)
{
    g_ulCommandFlags = 0;
    
    MemCopy((Uint16 *)&RamfuncsLoadStart, (Uint16 *)&RamfuncsLoadEnd,
            (Uint16 *)&RamfuncsRunStart);

#ifdef BL_REINIT_FN_HOOK
    BL_REINIT_FN_HOOK(void);
#endif

    //
    // If the target device has a mux to allow selection of USB host or
    // device mode, make sure this is set to device mode.
    //
#ifdef USB_HAS_MUX
    SetUSBMux();
#endif

    //
    // Configure the USB interface and put the device on the bus.
    //
    ConfigureUSBInterface();
    
#ifdef ENABLE_WATCHDOG
    WatchdogEnable();
#endif    

    //
    // Call the main update routine.
    //
    UpdaterUSB();
}

//*****************************************************************************
//
//! This is the normal bootloader entry point
//!
//! \return None.
//
//*****************************************************************************
#pragma CODE_SECTION(main, "normal")
void main(void)
{
    MemCopy((Uint16 *)&RamfuncsLoadStart, (Uint16 *)&RamfuncsLoadEnd, 
            (Uint16 *)&RamfuncsRunStart);

    //
    // Application check and branch
    //
    AppCheck();
    
    g_ulCommandFlags = 0;
    
#ifdef ENABLE_FAILSAFE
    g_bFailsafe = false;
#endif    
    
#ifdef BL_HW_INIT_FN_HOOK
    BL_HW_INIT_FN_HOOK(void);
#endif    

    ConfigureUSB();    
    
#ifdef BL_INIT_FN_HOOK
    BL_INIT_FN_HOOK(void);
#endif    

#ifdef ENABLE_WATCHDOG
    WatchdogEnable();
#endif    
    
    UpdaterUSB();
    
    while(1);
}

#ifdef ENABLE_FAILSAFE
//*****************************************************************************
//
//! This is the failsafe bootloader entry point
//!
//! \return None.
//
//*****************************************************************************
#pragma CODE_SECTION(FailsafeEntry, "failsafe")
void FailsafeEntry(void)
{
    g_ulCommandFlags = 0;
    
    //
    // Set failsafe flag because we are in failsafe mode
    //
    g_bFailsafe = true;
    
    //
    // Copy BL to RAM
    //
    FailSafeMemCopy(&RamfuncsLoadStart + 0x4000, &RamfuncsLoadEnd + 0x4000, 
                    &RamfuncsRunStart);
    
    ConfigureUSB();
    
#ifdef ENABLE_WATCHDOG
    WatchdogEnable();
#endif        

    UpdaterUSB();
    while(1);
}
#endif

//*****************************************************************************
//
// Close the Doxygen group.
//! @}
//
//*****************************************************************************

//
// End of File
//

